Core/src/Documents/AzRyКонвертацияВалюты/AzRyКонвертацияВалюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>AzRyКонвертацияВалюты</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccumulationRegister.ПлатежныйКалендарь</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет1</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Касса1</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет2</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Касса2</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДатаКурсаВалюты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_Валюта1</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_Валюта2</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ВалютаУчета</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийРасходСоСчета</types>
      <types>EnumRef.AzRyВидыОперацийКонвертацияВалюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаОпераций</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеКонвертаций</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетДебетРасход</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКредитПриход</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипыКонвертацияВалюты</name>
    <type>
      <types>EnumRef.AzRyТипыКонвертацияВалюты</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyПроекты</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyJiraCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корреспонденция</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
</mdclass:Document>

Core/src/Enums/ТипыСчетов/ТипыСчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСчетов</name>
  <enumValues>
    <name>АмортизацияВнеоборотныхАктивов</name>
    <comment>02</comment>
  </enumValues>
  <enumValues>
    <name>ВнеоборотныеАктивы</name>
    <comment>01</comment>
  </enumValues>
  <enumValues>
    <name>ГруппаСчетов</name>
    <comment>Служебный</comment>
  </enumValues>
  <enumValues>
    <name>Дебиторы</name>
    <comment>62.01, 60.02, 68.02, 71.02</comment>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредства</name>
    <comment>50, 51, 57</comment>
  </enumValues>
  <enumValues>
    <name>ДолгосрочныеОбязательства</name>
    <comment>67</comment>
  </enumValues>
  <enumValues>
    <name>Доходы</name>
    <comment>90.01</comment>
  </enumValues>
  <enumValues>
    <name>Запасы</name>
    <comment>10, 41</comment>
  </enumValues>
  <enumValues>
    <name>Капитал</name>
    <comment>80</comment>
  </enumValues>
  <enumValues>
    <name>КосвенныеЗатраты</name>
    <comment>25</comment>
  </enumValues>
  <enumValues>
    <name>КраткосрочныеФинансовыеВложения</name>
    <comment>58</comment>
  </enumValues>
  <enumValues>
    <name>Кредиторы</name>
    <comment>60.01, 62.02, 68.01, 70.01, 71.01</comment>
  </enumValues>
  <enumValues>
    <name>КредитыИЗаймы</name>
    <comment>66</comment>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыль</name>
  </enumValues>
  <enumValues>
    <name>НезавершенноеПроизводство</name>
    <comment>20</comment>
  </enumValues>
  <enumValues>
    <name>НераспределеннаяПрибыль</name>
    <comment>84</comment>
  </enumValues>
  <enumValues>
    <name>ПрибылиУбытки</name>
    <comment>99</comment>
  </enumValues>
  <enumValues>
    <name>ПроцентыПоКредитам</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеВнеоборотныеАктивы</name>
    <comment>08</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходы</name>
    <comment>90.01</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеКраткосрочныеОбязательства</name>
    <comment>98</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеОборотныеАктивы</name>
    <comment>94, 97</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасходы</name>
    <comment>91.02</comment>
  </enumValues>
  <enumValues>
    <name>Расходы</name>
    <comment>90.07, 90.08</comment>
  </enumValues>
  <enumValues>
    <name>РезервныйИДобавочныйКапитал</name>
    <comment>82</comment>
  </enumValues>
  <enumValues>
    <name>СебестоимостьПродаж</name>
    <comment>90.02</comment>
  </enumValues>
  <enumValues>
    <name>ТорговаяНаценка</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/AzRyТипыКонвертацияВалюты/AzRyТипыКонвертацияВалюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AzRyТипыКонвертацияВалюты</name>
  <enumValues>
    <name>Безналичные</name>
  </enumValues>
  <enumValues>
    <name>Наличные</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/AzRyКонвертацияВалюты/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события ПередЗаписью объекта.
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Константы.ФункциональнаяОпцияУчетПоНесколькимНаправлениямДеятельности.Получить()
		И Корреспонденция.ТипСчета = Перечисления.ТипыСчетов.Расходы Тогда
		
		НаправлениеДеятельности = Справочники.НаправленияДеятельности.ОсновноеНаправление;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроведения объекта.
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//ИзменитьКурсыВалют();
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();	
	
	// Безналичные денежные средство
	Если ТипыКонвертацияВалюты = Перечисления.AzRyТипыКонвертацияВалюты.Безналичные Тогда 	
		
		
		// Проверка заполнения реквизита банковский счет
		Если БанковскийСчет1 = Справочники.БанковскиеСчета.ПустаяСсылка() Или БанковскийСчет2 = Справочники.БанковскиеСчета.ПустаяСсылка() Тогда 
			Отказ = Истина;
			Сообщить(НСтр("ru = 'Поле банковскийСчет не заполнено'; ka = 'საბანკო ანგარიშის ველი შევსებული არაა'"));
			Возврат;
		КонецЕсли;	
		
		// 1) Поступление на счет -------------------------------------------------------------------------------------------------
		
		// Инициализация дополнительных свойств для проведения документа	
		УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
		
		// Инициализация данных документа
		Документы.AzRyКонвертацияВалюты.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства, "ПоступлениеНаСчет");
		
		// Подготовка наборов записей
		УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
		
		// Отражение в разделах учета
		//УправлениеНебольшойФирмойСервер.ОтразитьДенежныеСредства(ДополнительныеСвойства, Движения, Отказ);
		//УправлениеНебольшойФирмойСервер.ОтразитьУправленческий(ДополнительныеСвойства, Движения, Отказ);
		//УправлениеНебольшойФирмойСервер.ОтразитьПлатежныйКалендарь(ДополнительныеСвойства, Движения, Отказ);
		
		СТР = ДополнительныеСвойства.ТаблицыДляДвижений;
		
		// Запись наборов записей
		УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		
		//ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
		
		
		// 2) Расход со счета  -------------------------------------------------------------------------------------------------
		
		ДополнительныеСвойства.Очистить();
		
		// Инициализация дополнительных свойств для проведения документа
		УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
		
		// Инициализация данных документа
		Документы.AzRyКонвертацияВалюты.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства, "РасходСоСчета");
		
		// Подготовка наборов записей
		УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
		
		Для каждого ТекСтрока Из СТР Цикл
			
			Если ТекСтрока.Ключ = "ТаблицаДенежныеСредства" Тогда 			
				Для каждого ТекСтрока2 Из ТекСтрока.Значение Цикл
					НовСтрока = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДенежныеСредства.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрока, ТекСтрока2);
				КонецЦикла; 
			КонецЕсли;	 
			
			Если ТекСтрока.Ключ = "ТаблицаУправленческий" Тогда 			
				Для каждого ТекСтрока2 Из ТекСтрока.Значение Цикл
					НовСтрока = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУправленческий.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрока, ТекСтрока2);
				КонецЦикла; 
			КонецЕсли;
			
			Если ТекСтрока.Ключ = "ТаблицаПлатежныйКалендарь" Тогда 			
				Для каждого ТекСтрока2 Из ТекСтрока.Значение Цикл
					НовСтрока = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПлатежныйКалендарь.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрока, ТекСтрока2);
				КонецЦикла; 
			КонецЕсли;
			
			Если ТекСтрока.Ключ = "ТаблицаДоходыИРасходы" Тогда 			
				Для каждого ТекСтрока2 Из ТекСтрока.Значение Цикл
					НовСтрока = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыИРасходы.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрока, ТекСтрока2);
				КонецЦикла; 
			КонецЕсли;
			
		КонецЦикла;
		
		// Отражение в разделах учета
		УправлениеНебольшойФирмойСервер.ОтразитьДенежныеСредства(ДополнительныеСвойства, Движения, Отказ);
		УправлениеНебольшойФирмойСервер.ОтразитьПлатежныйКалендарь(ДополнительныеСвойства, Движения, Отказ);
		УправлениеНебольшойФирмойСервер.ОтразитьУправленческий(ДополнительныеСвойства, Движения, Отказ);
		УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходы(ДополнительныеСвойства, Движения, Отказ);		
		// Запись наборов записей
		УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		
		ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
		
	ИначеЕсли ТипыКонвертацияВалюты = Перечисления.AzRyТипыКонвертацияВалюты.Наличные Тогда // Наличные денежные средство
		
        // Проверка заполнения реквизита касса
		Если Касса1 = Справочники.Кассы.ПустаяСсылка() Или Касса2 = Справочники.Кассы.ПустаяСсылка() Тогда 
			Отказ = Истина;
			Сообщить(НСтр("ru = 'Поле касса не заполнено'; ka = 'სალაროს ველი შევსებული არაა'"));
			Возврат;
		КонецЕсли;
		
		// 1) Поступление в кассу -------------------------------------------------------------------------------------------------
		
		// Инициализация дополнительных свойств для проведения документа	
		УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
		
		// Инициализация данных документа
		Документы.AzRyКонвертацияВалюты.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства, "ПоступлениеВКассу");
		
		// Подготовка наборов записей
		УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

		СТР = ДополнительныеСвойства.ТаблицыДляДвижений;
		
		// Запись наборов записей
		УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);

		
		// 1) Расход из кассы  ------------------------------------------------------------------------------------------------- 
		
		ДополнительныеСвойства.Очистить();
		
		// Инициализация дополнительных свойств для проведения документа
		УправлениеНебольшойФирмойСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
		
		// Инициализация данных документа
		Документы.AzRyКонвертацияВалюты.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства, "РасходИзКассы");
		
		// Подготовка наборов записей
		УправлениеНебольшойФирмойСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
		
		Для каждого ТекСтрока Из СТР Цикл
			
			Если ТекСтрока.Ключ = "ТаблицаДенежныеСредства" Тогда 			
				Для каждого ТекСтрока2 Из ТекСтрока.Значение Цикл
					НовСтрока = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДенежныеСредства.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрока, ТекСтрока2);
				КонецЦикла; 
			КонецЕсли;	 
			
			Если ТекСтрока.Ключ = "ТаблицаУправленческий" Тогда 			
				Для каждого ТекСтрока2 Из ТекСтрока.Значение Цикл
					НовСтрока = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУправленческий.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрока, ТекСтрока2);
				КонецЦикла; 
			КонецЕсли;
			
			Если ТекСтрока.Ключ = "ТаблицаПлатежныйКалендарь" Тогда 			
				Для каждого ТекСтрока2 Из ТекСтрока.Значение Цикл
					НовСтрока = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПлатежныйКалендарь.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрока, ТекСтрока2);
				КонецЦикла; 
			КонецЕсли;
			
			Если ТекСтрока.Ключ = "ТаблицаДоходыИРасходы" Тогда 			
				Для каждого ТекСтрока2 Из ТекСтрока.Значение Цикл
					НовСтрока = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаДоходыИРасходы.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтрока, ТекСтрока2);
				КонецЦикла; 
			КонецЕсли;

		КонецЦикла;
		
		// Отражение в разделах учета
		УправлениеНебольшойФирмойСервер.ОтразитьДенежныеСредства(ДополнительныеСвойства, Движения, Отказ);
		УправлениеНебольшойФирмойСервер.ОтразитьПлатежныйКалендарь(ДополнительныеСвойства, Движения, Отказ);
		УправлениеНебольшойФирмойСервер.ОтразитьУправленческий(ДополнительныеСвойства, Движения, Отказ);
		УправлениеНебольшойФирмойСервер.ОтразитьДоходыИРасходы(ДополнительныеСвойства, Движения, Отказ);
		
		// Запись наборов записей
		УправлениеНебольшойФирмойСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		
		ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
		
	Иначе 
		
		Сообщить(НСтр("ru = 'Не указан тип конвертаций'; ka = 'არ არის მითითებული კონვერტაციის ტიპი'"));
		Отказ = Истина;	
		
	КонецЕсли;
	
	
КонецПроцедуры




////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
